7767517
226 233
Input                    in0                      0 1 in0
Convolution              conv_5                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
ConvolutionDepthWise     convdw_87                1 1 1 2 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16
BinaryOp                 mul_0                    1 1 2 3 0=2 1=1 2=1.38411
BinaryOp                 add_1                    1 1 3 4 0=0 1=1 2=0.586077
HardSwish                hswish_41                1 1 4 5 0=0.166667 1=0.5
BinaryOp                 mul_2                    1 1 5 6 0=2 1=1 2=0.167519
BinaryOp                 add_3                    1 1 6 7 0=0 1=1 2=3.470043e-05
Convolution              conv_6                   1 1 7 8 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
BinaryOp                 mul_4                    1 1 8 9 0=2 1=1 2=2.11156
BinaryOp                 add_5                    1 1 9 10 0=0 1=1 2=1.05632
HardSwish                hswish_42                1 1 10 11 0=0.166667 1=0.5
BinaryOp                 mul_6                    1 1 11 12 0=2 1=1 2=0.182808
BinaryOp                 add_7                    1 1 12 13 0=0 1=1 2=-0.200855
ConvolutionDepthWise     convdw_88                1 1 13 14 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
BinaryOp                 mul_8                    1 1 14 15 0=2 1=1 2=2.16672
BinaryOp                 add_9                    1 1 15 16 0=0 1=1 2=1.00086
HardSwish                hswish_43                1 1 16 17 0=0.166667 1=0.5
BinaryOp                 mul_10                   1 1 17 18 0=2 1=1 2=0.0606308
BinaryOp                 add_11                   1 1 18 19 0=0 1=1 2=-4.069060e-05
Convolution              conv_7                   1 1 19 20 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
BinaryOp                 mul_12                   1 1 20 21 0=2 1=1 2=2.17223
BinaryOp                 add_13                   1 1 21 22 0=0 1=1 2=0.858351
HardSwish                hswish_44                1 1 22 23 0=0.166667 1=0.5
BinaryOp                 mul_14                   1 1 23 24 0=2 1=1 2=0.406195
BinaryOp                 add_15                   1 1 24 25 0=0 1=1 2=-0.278562
ConvolutionDepthWise     convdw_89                1 1 25 26 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
BinaryOp                 mul_16                   1 1 26 27 0=2 1=1 2=3.06962
BinaryOp                 add_17                   1 1 27 28 0=0 1=1 2=0.32436
HardSwish                hswish_45                1 1 28 29 0=0.166667 1=0.5
BinaryOp                 mul_18                   1 1 29 30 0=2 1=1 2=0.0309505
BinaryOp                 add_19                   1 1 30 31 0=0 1=1 2=-4.651240e-05
Convolution              conv_8                   1 1 31 32 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
BinaryOp                 mul_20                   1 1 32 33 0=2 1=1 2=2.16423
BinaryOp                 add_21                   1 1 33 34 0=0 1=1 2=0.433677
HardSwish                hswish_46                1 1 34 35 0=0.166667 1=0.5
BinaryOp                 mul_22                   1 1 35 36 0=2 1=1 2=0.428307
BinaryOp                 add_23                   1 1 36 37 0=0 1=1 2=-0.0837866
ConvolutionDepthWise     convdw_90                1 1 37 38 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=1 4=1 5=1 6=576 7=64
BinaryOp                 mul_24                   1 1 38 39 0=2 1=1 2=2.29373
BinaryOp                 add_25                   1 1 39 40 0=0 1=1 2=1.01906
HardSwish                hswish_47                1 1 40 41 0=0.166667 1=0.5
BinaryOp                 mul_26                   1 1 41 42 0=2 1=1 2=0.0327198
BinaryOp                 add_27                   1 1 42 43 0=0 1=1 2=-2.652152e-06
Convolution              conv_9                   1 1 43 44 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
BinaryOp                 mul_28                   1 1 44 45 0=2 1=1 2=1.7688
BinaryOp                 add_29                   1 1 45 46 0=0 1=1 2=0.218125
HardSwish                hswish_48                1 1 46 47 0=0.166667 1=0.5
BinaryOp                 mul_30                   1 1 47 48 0=2 1=1 2=0.730457
BinaryOp                 add_31                   1 1 48 49 0=0 1=1 2=-0.0857254
ConvolutionDepthWise     convdw_91                1 1 49 50 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
BinaryOp                 mul_32                   1 1 50 51 0=2 1=1 2=2.62363
BinaryOp                 add_33                   1 1 51 52 0=0 1=1 2=-0.00791828
HardSwish                hswish_49                1 1 52 53 0=0.166667 1=0.5
BinaryOp                 mul_34                   1 1 53 54 0=2 1=1 2=0.04377
BinaryOp                 add_35                   1 1 54 55 0=0 1=1 2=5.633773e-05
Convolution              conv_10                  1 1 55 56 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 mul_36                   1 1 56 57 0=2 1=1 2=1.89377
BinaryOp                 add_37                   1 1 57 58 0=0 1=1 2=-0.0486566
HardSwish                hswish_50                1 1 58 59 0=0.166667 1=0.5
BinaryOp                 mul_38                   1 1 59 60 0=2 1=1 2=0.652846
BinaryOp                 add_39                   1 1 60 61 0=0 1=1 2=0.0737929
ConvolutionDepthWise     convdw_92                1 1 61 62 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=2 4=1 5=1 6=1152 7=128
BinaryOp                 mul_40                   1 1 62 63 0=2 1=1 2=2.48211
BinaryOp                 add_41                   1 1 63 64 0=0 1=1 2=0.659992
HardSwish                hswish_51                1 1 64 65 0=0.166667 1=0.5
BinaryOp                 mul_42                   1 1 65 66 0=2 1=1 2=0.023533
BinaryOp                 add_43                   1 1 66 67 0=0 1=1 2=5.462020e-05
Convolution              conv_11                  1 1 67 68 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=30720
BinaryOp                 mul_44                   1 1 68 69 0=2 1=1 2=1.52363
BinaryOp                 add_45                   1 1 69 70 0=0 1=1 2=0.0639285
HardSwish                hswish_52                1 1 70 71 0=0.166667 1=0.5
BinaryOp                 mul_46                   1 1 71 72 0=2 1=1 2=0.524929
BinaryOp                 add_47                   1 1 72 73 0=0 1=1 2=-0.0116787
ConvolutionDepthWise     convdw_93                1 1 73 74 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6000 7=240
BinaryOp                 mul_48                   1 1 74 75 0=2 1=1 2=2.13887
BinaryOp                 add_49                   1 1 75 76 0=0 1=1 2=-0.450772
HardSwish                hswish_53                1 1 76 77 0=0.166667 1=0.5
BinaryOp                 mul_50                   1 1 77 78 0=2 1=1 2=0.118149
BinaryOp                 add_51                   1 1 78 79 0=0 1=1 2=-6.013525e-05
Convolution              conv_12                  1 1 79 80 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
BinaryOp                 mul_52                   1 1 80 81 0=2 1=1 2=2.04455
BinaryOp                 add_53                   1 1 81 82 0=0 1=1 2=-0.243105
HardSwish                hswish_54                1 1 82 83 0=0.166667 1=0.5
BinaryOp                 mul_54                   1 1 83 84 0=2 1=1 2=0.621993
BinaryOp                 add_55                   1 1 84 85 0=0 1=1 2=0.0885999
ConvolutionDepthWise     convdw_94                1 1 85 86 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6000 7=240
BinaryOp                 mul_56                   1 1 86 87 0=2 1=1 2=2.83098
BinaryOp                 add_57                   1 1 87 88 0=0 1=1 2=0.10215
HardSwish                hswish_55                1 1 88 89 0=0.166667 1=0.5
BinaryOp                 mul_58                   1 1 89 90 0=2 1=1 2=0.0421663
BinaryOp                 add_59                   1 1 90 91 0=0 1=1 2=-5.604238e-05
Convolution              conv_13                  1 1 91 92 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
BinaryOp                 mul_60                   1 1 92 93 0=2 1=1 2=2.15634
BinaryOp                 add_61                   1 1 93 94 0=0 1=1 2=-0.55896
HardSwish                hswish_56                1 1 94 95 0=0.166667 1=0.5
BinaryOp                 mul_62                   1 1 95 96 0=2 1=1 2=0.532749
BinaryOp                 add_63                   1 1 96 97 0=0 1=1 2=0.156819
ConvolutionDepthWise     convdw_95                1 1 97 98 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6000 7=240
BinaryOp                 mul_64                   1 1 98 99 0=2 1=1 2=2.50671
BinaryOp                 add_65                   1 1 99 100 0=0 1=1 2=1.15701
HardSwish                hswish_57                1 1 100 101 0=0.166667 1=0.5
BinaryOp                 mul_66                   1 1 101 102 0=2 1=1 2=0.0452073
BinaryOp                 add_67                   1 1 102 103 0=0 1=1 2=-3.584615e-06
Convolution              conv_14                  1 1 103 104 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
BinaryOp                 mul_68                   1 1 104 105 0=2 1=1 2=2.15081
BinaryOp                 add_69                   1 1 105 106 0=0 1=1 2=-0.554704
HardSwish                hswish_58                1 1 106 107 0=0.166667 1=0.5
BinaryOp                 mul_70                   1 1 107 108 0=2 1=1 2=0.537042
BinaryOp                 add_71                   1 1 108 109 0=0 1=1 2=0.173517
ConvolutionDepthWise     convdw_96                1 1 109 110 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6000 7=240
BinaryOp                 mul_72                   1 1 110 111 0=2 1=1 2=2.48124
BinaryOp                 add_73                   1 1 111 112 0=0 1=1 2=1.14582
HardSwish                hswish_59                1 1 112 113 0=0.166667 1=0.5
BinaryOp                 mul_74                   1 1 113 114 0=2 1=1 2=0.0544685
BinaryOp                 add_75                   1 1 114 115 0=0 1=1 2=4.943241e-05
Convolution              conv_15                  1 1 115 116 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
BinaryOp                 mul_76                   1 1 116 117 0=2 1=1 2=2.1697
BinaryOp                 add_77                   1 1 117 118 0=0 1=1 2=-0.648008
HardSwish                hswish_60                1 1 118 119 0=0.166667 1=0.5
BinaryOp                 mul_78                   1 1 119 120 0=2 1=1 2=0.700639
BinaryOp                 add_79                   1 1 120 121 0=0 1=1 2=0.238048
ConvolutionDepthWise     convdw_97                1 1 121 122 0=240 1=5 11=5 12=1 13=2 14=2 2=1 3=1 4=2 5=1 6=6000 7=240
BinaryOp                 mul_80                   1 1 122 123 0=2 1=1 2=1.92619
BinaryOp                 add_81                   1 1 123 124 0=0 1=1 2=0.454244
HardSwish                hswish_61                1 1 124 125 0=0.166667 1=0.5
BinaryOp                 mul_82                   1 1 125 126 0=2 1=1 2=1.39304
BinaryOp                 add_83                   1 1 126 127 0=0 1=1 2=-0.413637
Split                    splitncnn_0              1 2 127 128 129
Pooling                  gap_36                   1 1 129 130 0=1 4=1
Convolution              convrelu_0               1 1 130 131 0=60 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14400 9=1
Convolution              conv_17                  1 1 131 132 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=14400
HardSigmoid              hsigmoid_39              1 1 132 133 0=0.166667 1=0.5
Reshape                  reshape_82               1 1 133 134 0=1 1=1 2=-1
BinaryOp                 mul_84                   2 1 128 134 135 0=2
Convolution              conv_18                  1 1 135 136 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=115200
BinaryOp                 mul_85                   1 1 136 137 0=2 1=1 2=2.59266
BinaryOp                 add_86                   1 1 137 138 0=0 1=1 2=-0.43063
HardSwish                hswish_62                1 1 138 139 0=0.166667 1=0.5
BinaryOp                 mul_87                   1 1 139 140 0=2 1=1 2=0.912226
BinaryOp                 add_88                   1 1 140 141 0=0 1=1 2=0.202191
ConvolutionDepthWise     convdw_98                1 1 141 142 0=480 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=12000 7=480
BinaryOp                 mul_89                   1 1 142 143 0=2 1=1 2=2.17948
BinaryOp                 add_90                   1 1 143 144 0=0 1=1 2=0.245943
HardSwish                hswish_63                1 1 144 145 0=0.166667 1=0.5
BinaryOp                 mul_91                   1 1 145 146 0=2 1=1 2=1.98366
BinaryOp                 add_92                   1 1 146 147 0=0 1=1 2=-0.746778
Split                    splitncnn_1              1 2 147 148 149
Pooling                  gap_37                   1 1 149 150 0=1 4=1
Convolution              convrelu_1               1 1 150 151 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600 9=1
Convolution              conv_20                  1 1 151 152 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
HardSigmoid              hsigmoid_40              1 1 152 153 0=0.166667 1=0.5
Reshape                  reshape_83               1 1 153 154 0=1 1=1 2=-1
BinaryOp                 mul_93                   2 1 148 154 155 0=2
Convolution              conv_21                  1 1 155 156 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=230400
BinaryOp                 mul_94                   1 1 156 157 0=2 1=1 2=2.58692
BinaryOp                 add_95                   1 1 157 158 0=0 1=1 2=-0.801554
HardSwish                hswish_64                1 1 158 159 0=0.166667 1=0.5
BinaryOp                 mul_96                   1 1 159 160 0=2 1=1 2=0.658983
BinaryOp                 add_97                   1 1 160 161 0=0 1=1 2=0.211937
ConvolutionDepthWise     convdw_99                1 1 161 162 0=480 1=5 11=5 12=1 13=2 14=2 2=1 3=1 4=2 5=1 6=12000 7=480
BinaryOp                 mul_98                   1 1 162 163 0=2 1=1 2=2.34803
BinaryOp                 add_99                   1 1 163 164 0=0 1=1 2=1.66534
HardSwish                hswish_65                1 1 164 165 0=0.166667 1=0.5
BinaryOp                 mul_100                  1 1 165 166 0=2 1=1 2=0.0709875
BinaryOp                 add_101                  1 1 166 167 0=0 1=1 2=0.00027809
Convolution              conv_22                  1 1 167 168 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=230400
BinaryOp                 mul_102                  1 1 168 169 0=2 1=1 2=3.17317
BinaryOp                 add_103                  1 1 169 170 0=0 1=1 2=-0.636599
HardSwish                hswish_66                1 1 170 171 0=0.166667 1=0.5
BinaryOp                 mul_104                  1 1 171 172 0=2 1=1 2=0.465653
BinaryOp                 add_105                  1 1 172 173 0=0 1=1 2=0.128581
ConvolutionDepthWise     convdw_100               1 1 173 174 0=480 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=12000 7=480
BinaryOp                 mul_106                  1 1 174 175 0=2 1=1 2=2.98104
BinaryOp                 add_107                  1 1 175 176 0=0 1=1 2=0.115551
HardSwish                hswish_67                1 1 176 177 0=0.166667 1=0.5
BinaryOp                 mul_108                  1 1 177 178 0=2 1=1 2=0.397638
BinaryOp                 add_109                  1 1 178 179 0=0 1=1 2=2.775773e-05
Convolution              conv_23                  1 1 179 180 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=230400
BinaryOp                 mul_110                  1 1 180 181 0=2 1=1 2=3.72586
BinaryOp                 add_111                  1 1 181 182 0=0 1=1 2=-0.36399
HardSwish                hswish_68                1 1 182 183 0=0.166667 1=0.5
BinaryOp                 mul_112                  1 1 183 184 0=2 1=1 2=3.34848
BinaryOp                 add_113                  1 1 184 185 0=0 1=1 2=-0.0717418
Pooling                  avgpool2d_38             1 1 185 186 0=1 1=2 11=3 12=3 13=0 2=2 3=0 5=1 6=0
Split                    splitncnn_2              1 2 186 187 188
Convolution              conv_24                  1 1 188 189 0=60 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=86400
Swish                    silu_71                  1 1 189 190
Convolution              conv_25                  1 1 190 191 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200
Swish                    silu_72                  1 1 191 192
Reshape                  reshape_84               1 1 192 193 0=40 1=120
Permute                  permute_79               1 1 193 194 0=1
Split                    splitncnn_3              1 2 194 195 196
LayerNorm                ln_29                    1 1 196 197 0=120 1=1.000000e-05 2=1
MultiHeadAttention       attention_34             1 1 197 198 0=120 1=8 2=14400 3=120 4=120
BinaryOp                 add_114                  2 1 195 198 199 0=0
Split                    splitncnn_4              1 2 199 200 201
LayerNorm                ln_30                    1 1 201 202 0=120 1=1.000000e-05 2=1
Gemm                     gemm_0                   1 1 202 203 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=240 9=120
Swish                    silu_73                  1 1 203 204
Gemm                     gemm_1                   1 1 204 205 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=120 9=240
BinaryOp                 add_115                  2 1 200 205 206 0=0
Split                    splitncnn_5              1 2 206 207 208
LayerNorm                ln_31                    1 1 208 209 0=120 1=1.000000e-05 2=1
MultiHeadAttention       attention_35             1 1 209 210 0=120 1=8 2=14400 3=120 4=120
BinaryOp                 add_116                  2 1 207 210 211 0=0
Split                    splitncnn_6              1 2 211 212 213
LayerNorm                ln_32                    1 1 213 214 0=120 1=1.000000e-05 2=1
Gemm                     gemm_2                   1 1 214 215 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=240 9=120
Swish                    silu_74                  1 1 215 216
Gemm                     gemm_3                   1 1 216 217 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=120 9=240
BinaryOp                 add_117                  2 1 212 217 218 0=0
LayerNorm                ln_33                    1 1 218 219 0=120 1=1.000000e-06 2=1
Reshape                  reshape_85               1 1 219 220 0=120 1=40 2=1
Permute                  permute_80               1 1 220 221 0=4
Convolution              conv_26                  1 1 221 222 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=57600
Swish                    silu_75                  1 1 222 223
Concat                   cat_0                    2 1 187 223 224 0=0
Convolution              conv_27                  1 1 224 225 0=60 1=3 11=1 12=1 13=1 14=0 2=1 3=1 4=1 5=1 6=172800
Swish                    silu_76                  1 1 225 226
Convolution              conv_28                  1 1 226 227 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7200
Swish                    silu_77                  1 1 227 228
Squeeze                  squeeze_86               1 1 228 229 -23303=1,1
Permute                  permute_81               1 1 229 230 0=1
Gemm                     gemm_4                   1 1 230 231 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=6625 9=120
Softmax                  softmax_78               1 1 231 out0 0=1 1=1
