7767517
117 133
Input                    in0                      0 1 in0
Convolution              conv_0                   1 1 in0 1 0=8 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=216
HardSwish                hswish_43                1 1 1 2 0=0.166667 1=0.5
Split                    splitncnn_0              1 2 2 3 4
Convolution              convrelu_0               1 1 4 5 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64 9=1
ConvolutionDepthWise     convdwrelu_0             1 1 5 6 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=72 7=8 9=1
Convolution              conv_2                   1 1 6 7 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
BinaryOp                 add_0                    2 1 3 7 8 0=0
Convolution              convrelu_1               1 1 8 9 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 9 10 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=288 7=32 9=1
Convolution              conv_4                   1 1 10 11 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Split                    splitncnn_1              1 2 11 12 13
Convolution              convrelu_2               1 1 13 14 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=640 9=1
ConvolutionDepthWise     convdwrelu_2             1 1 14 15 0=40 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=360 7=40 9=1
Convolution              conv_6                   1 1 15 16 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=640
BinaryOp                 add_1                    2 1 12 16 17 0=0
Split                    splitncnn_2              1 2 17 18 19
Convolution              convrelu_3               1 1 19 20 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=640 9=1
ConvolutionDepthWise     convdwrelu_3             1 1 20 21 0=40 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=1000 7=40 9=1
Convolution              conv_8                   1 1 21 22 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=960
Split                    splitncnn_3              1 2 22 23 24
Convolution              convrelu_4               1 1 24 25 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536 9=1
ConvolutionDepthWise     convdwrelu_4             1 1 25 26 0=64 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1600 7=64 9=1
Convolution              conv_10                  1 1 26 27 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
BinaryOp                 add_2                    2 1 23 27 28 0=0
Split                    splitncnn_4              1 2 28 29 30
Convolution              convrelu_5               1 1 30 31 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536 9=1
ConvolutionDepthWise     convdwrelu_5             1 1 31 32 0=64 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=1600 7=64 9=1
Convolution              conv_12                  1 1 32 33 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
BinaryOp                 add_3                    2 1 29 33 34 0=0
Split                    splitncnn_5              1 2 34 35 36
Convolution              conv_13                  1 1 36 37 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2880
HardSwish                hswish_44                1 1 37 38 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_90                1 1 38 39 0=120 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1080 7=120
HardSwish                hswish_45                1 1 39 40 0=0.166667 1=0.5
Convolution              conv_14                  1 1 40 41 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4800
Split                    splitncnn_6              1 2 41 42 43
Convolution              conv_15                  1 1 43 44 0=104 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4160
HardSwish                hswish_46                1 1 44 45 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_91                1 1 45 46 0=104 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=936 7=104
HardSwish                hswish_47                1 1 46 47 0=0.166667 1=0.5
Convolution              conv_16                  1 1 47 48 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4160
BinaryOp                 add_4                    2 1 42 48 49 0=0
Split                    splitncnn_7              1 2 49 50 51
Convolution              conv_17                  1 1 51 52 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840
HardSwish                hswish_48                1 1 52 53 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_92                1 1 53 54 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
HardSwish                hswish_49                1 1 54 55 0=0.166667 1=0.5
Convolution              conv_18                  1 1 55 56 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840
BinaryOp                 add_5                    2 1 50 56 57 0=0
Split                    splitncnn_8              1 2 57 58 59
Convolution              conv_19                  1 1 59 60 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840
HardSwish                hswish_50                1 1 60 61 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_93                1 1 61 62 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
HardSwish                hswish_51                1 1 62 63 0=0.166667 1=0.5
Convolution              conv_20                  1 1 63 64 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840
BinaryOp                 add_6                    2 1 58 64 65 0=0
Convolution              conv_21                  1 1 65 66 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600
HardSwish                hswish_52                1 1 66 67 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_94                1 1 67 68 0=240 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2160 7=240
HardSwish                hswish_53                1 1 68 69 0=0.166667 1=0.5
Convolution              conv_22                  1 1 69 70 0=56 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13440
Split                    splitncnn_9              1 2 70 71 72
Convolution              conv_23                  1 1 72 73 0=336 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18816
HardSwish                hswish_54                1 1 73 74 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_95                1 1 74 75 0=336 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3024 7=336
HardSwish                hswish_55                1 1 75 76 0=0.166667 1=0.5
Convolution              conv_24                  1 1 76 77 0=56 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18816
BinaryOp                 add_7                    2 1 71 77 78 0=0
Split                    splitncnn_10             1 2 78 79 80
Convolution              conv_25                  1 1 80 81 0=336 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18816
HardSwish                hswish_56                1 1 81 82 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_96                1 1 82 83 0=336 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=8400 7=336
HardSwish                hswish_57                1 1 83 84 0=0.166667 1=0.5
Convolution              conv_26                  1 1 84 85 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=26880
Split                    splitncnn_11             1 2 85 86 87
Convolution              conv_27                  1 1 87 88 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=38400
HardSwish                hswish_58                1 1 88 89 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_97                1 1 89 90 0=480 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=12000 7=480
HardSwish                hswish_59                1 1 90 91 0=0.166667 1=0.5
Convolution              conv_28                  1 1 91 92 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=38400
BinaryOp                 add_8                    2 1 86 92 93 0=0
Split                    splitncnn_12             1 2 93 94 95
Convolution              conv_29                  1 1 95 96 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=38400
HardSwish                hswish_60                1 1 96 97 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_98                1 1 97 98 0=480 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=12000 7=480
HardSwish                hswish_61                1 1 98 99 0=0.166667 1=0.5
Convolution              conv_30                  1 1 99 100 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=38400
BinaryOp                 add_9                    2 1 94 100 101 0=0
Convolution              conv_31                  1 1 101 102 0=480 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=38400
HardSwish                hswish_62                1 1 102 103 0=0.166667 1=0.5
Convolution              conv_32                  1 1 103 104 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=46080
Split                    splitncnn_13             1 2 104 105 106
Convolution              conv_33                  1 1 79 107 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=5376
Convolution              conv_34                  1 1 35 108 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=2304
Convolution              conv_35                  1 1 18 109 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=1536
Interp                   interpolate_63           1 1 106 110 0=1 1=2.0 2=2.0 6=0
BinaryOp                 add_10                   2 1 107 110 111 0=0
Split                    splitncnn_14             1 2 111 112 113
Interp                   interpolate_64           1 1 113 114 0=1 1=2.0 2=2.0 6=0
BinaryOp                 add_11                   2 1 108 114 115 0=0
Split                    splitncnn_15             1 2 115 116 117
Interp                   interpolate_65           1 1 117 118 0=1 1=2.0 2=2.0 6=0
BinaryOp                 add_12                   2 1 109 118 119 0=0
Convolution              conv_36                  1 1 105 120 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=20736
Convolution              conv_37                  1 1 112 121 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=20736
Convolution              conv_38                  1 1 116 122 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=20736
Convolution              conv_39                  1 1 119 123 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=0 6=20736
Interp                   interpolate_66           1 1 120 124 0=1 1=8.0 2=8.0 6=0
Interp                   interpolate_67           1 1 121 125 0=1 1=4.0 2=4.0 6=0
Interp                   interpolate_68           1 1 122 126 0=1 1=2.0 2=2.0 6=0
Concat                   cat_0                    4 1 124 125 126 123 127 0=0
Convolution              convrelu_6               1 1 127 128 0=24 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Deconvolution            deconvrelu_0             1 1 128 129 0=24 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=2304 9=1
Deconvolution            deconv_42                1 1 129 130 0=1 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=0 6=96
BinaryOp                 add_13                   1 1 130 131 0=0 1=1 2=-0.226421
Sigmoid                  sigmoid_83               1 1 131 out0
