7767517
111 118
Input                    in0                      0 1 in0
Convolution              conv_5                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
HardSwish                hswish_40                1 1 1 2 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_85                1 1 2 3 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16
HardSwish                hswish_41                1 1 3 4 0=0.166667 1=0.5
Convolution              conv_6                   1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
HardSwish                hswish_42                1 1 5 6 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_86                1 1 6 7 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
HardSwish                hswish_43                1 1 7 8 0=0.166667 1=0.5
Convolution              conv_7                   1 1 8 9 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
HardSwish                hswish_44                1 1 9 10 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_87                1 1 10 11 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
HardSwish                hswish_45                1 1 11 12 0=0.166667 1=0.5
Convolution              conv_8                   1 1 12 13 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
HardSwish                hswish_46                1 1 13 14 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_88                1 1 14 15 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=1 4=1 5=1 6=576 7=64
HardSwish                hswish_47                1 1 15 16 0=0.166667 1=0.5
Convolution              conv_9                   1 1 16 17 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
HardSwish                hswish_48                1 1 17 18 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_89                1 1 18 19 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
HardSwish                hswish_49                1 1 19 20 0=0.166667 1=0.5
Convolution              conv_10                  1 1 20 21 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSwish                hswish_50                1 1 21 22 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_90                1 1 22 23 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
HardSwish                hswish_51                1 1 23 24 0=0.166667 1=0.5
Convolution              conv_11                  1 1 24 25 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
HardSwish                hswish_52                1 1 25 26 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_91                1 1 26 27 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
HardSwish                hswish_53                1 1 27 28 0=0.166667 1=0.5
Convolution              conv_12                  1 1 28 29 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSwish                hswish_54                1 1 29 30 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_92                1 1 30 31 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
HardSwish                hswish_55                1 1 31 32 0=0.166667 1=0.5
Convolution              conv_13                  1 1 32 33 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSwish                hswish_56                1 1 33 34 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_93                1 1 34 35 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
HardSwish                hswish_57                1 1 35 36 0=0.166667 1=0.5
Convolution              conv_14                  1 1 36 37 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSwish                hswish_58                1 1 37 38 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_94                1 1 38 39 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
HardSwish                hswish_59                1 1 39 40 0=0.166667 1=0.5
Convolution              conv_15                  1 1 40 41 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSwish                hswish_60                1 1 41 42 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_95                1 1 42 43 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
HardSwish                hswish_61                1 1 43 44 0=0.166667 1=0.5
Convolution              conv_16                  1 1 44 45 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSwish                hswish_62                1 1 45 46 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_96                1 1 46 47 0=256 1=5 11=5 12=1 13=2 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
HardSwish                hswish_63                1 1 47 48 0=0.166667 1=0.5
Split                    splitncnn_0              1 2 48 49 50
Pooling                  gap_35                   1 1 50 51 0=1 4=1
Convolution              convrelu_0               1 1 51 52 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              conv_18                  1 1 52 53 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSigmoid              hsigmoid_38              1 1 53 54 0=0.166667 1=0.5
Reshape                  reshape_80               1 1 54 55 0=1 1=1 2=-1
BinaryOp                 mul_0                    2 1 49 55 56 0=2
Convolution              conv_19                  1 1 56 57 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
HardSwish                hswish_64                1 1 57 58 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_97                1 1 58 59 0=512 1=5 11=5 12=1 13=1 14=2 2=1 3=2 4=2 5=1 6=12800 7=512
HardSwish                hswish_65                1 1 59 60 0=0.166667 1=0.5
Split                    splitncnn_1              1 2 60 61 62
Pooling                  gap_36                   1 1 62 63 0=1 4=1
Convolution              convrelu_1               1 1 63 64 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              conv_21                  1 1 64 65 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSigmoid              hsigmoid_39              1 1 65 66 0=0.166667 1=0.5
Reshape                  reshape_81               1 1 66 67 0=1 1=1 2=-1
BinaryOp                 mul_1                    2 1 61 67 68 0=2
Convolution              conv_22                  1 1 68 69 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
HardSwish                hswish_66                1 1 69 70 0=0.166667 1=0.5
Pooling                  avgpool2d_37             1 1 70 71 0=1 1=2 11=2 12=2 13=0 2=2 3=0 5=1 6=0
Split                    splitncnn_2              1 2 71 72 73
Convolution              conv_23                  1 1 73 74 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Swish                    silu_69                  1 1 74 75
Convolution              conv_24                  1 1 75 76 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680
Swish                    silu_70                  1 1 76 77
Reshape                  reshape_82               1 1 77 78 0=40 1=120
Permute                  permute_77               1 1 78 79 0=1
Split                    splitncnn_3              1 2 79 80 81
LayerNorm                ln_28                    1 1 81 82 0=120 1=1.000000e-05 2=1
MultiHeadAttention       attention_33             1 1 82 83 0=120 1=8 2=14400 3=120 4=120
BinaryOp                 add_2                    2 1 80 83 84 0=0
Split                    splitncnn_4              1 2 84 85 86
LayerNorm                ln_29                    1 1 86 87 0=120 1=1.000000e-05 2=1
Gemm                     gemm_0                   1 1 87 88 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=240 9=120
Swish                    silu_71                  1 1 88 89
Gemm                     gemm_1                   1 1 89 90 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=120 9=240
BinaryOp                 add_3                    2 1 85 90 91 0=0
Split                    splitncnn_5              1 2 91 92 93
LayerNorm                ln_30                    1 1 93 94 0=120 1=1.000000e-05 2=1
MultiHeadAttention       attention_34             1 1 94 95 0=120 1=8 2=14400 3=120 4=120
BinaryOp                 add_4                    2 1 92 95 96 0=0
Split                    splitncnn_6              1 2 96 97 98
LayerNorm                ln_31                    1 1 98 99 0=120 1=1.000000e-05 2=1
Gemm                     gemm_2                   1 1 99 100 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=240 9=120
Swish                    silu_72                  1 1 100 101
Gemm                     gemm_3                   1 1 101 102 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=120 9=240
BinaryOp                 add_5                    2 1 97 102 103 0=0
LayerNorm                ln_32                    1 1 103 104 0=120 1=1.000000e-06 2=1
Reshape                  reshape_83               1 1 104 105 0=120 1=40 2=1
Permute                  permute_78               1 1 105 106 0=4
Convolution              conv_25                  1 1 106 107 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=61440
Swish                    silu_73                  1 1 107 108
Concat                   cat_0                    2 1 72 108 109 0=0
Convolution              conv_26                  1 1 109 110 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_74                  1 1 110 111
Convolution              conv_27                  1 1 111 112 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_75                  1 1 112 113
Squeeze                  squeeze_84               1 1 113 114 -23303=1,1
Permute                  permute_79               1 1 114 115 0=1
Gemm                     gemm_4                   1 1 115 116 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=187 9=64
Softmax                  softmax_76               1 1 116 out0 0=1 1=1
