7767517
135 146
Input                    in0                      0 1 in0
Convolution              conv_9                   1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
HardSwish                hswish_42                1 1 1 2 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_109               1 1 2 3 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=144 7=16
HardSwish                hswish_43                1 1 3 4 0=0.166667 1=0.5
Convolution              conv_10                  1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
HardSwish                hswish_44                1 1 5 6 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_110               1 1 6 7 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=288 7=32
HardSwish                hswish_45                1 1 7 8 0=0.166667 1=0.5
Convolution              conv_11                  1 1 8 9 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
HardSwish                hswish_46                1 1 9 10 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_111               1 1 10 11 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
HardSwish                hswish_47                1 1 11 12 0=0.166667 1=0.5
Convolution              conv_12                  1 1 12 13 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
HardSwish                hswish_48                1 1 13 14 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_112               1 1 14 15 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=1 4=1 5=1 6=576 7=64
HardSwish                hswish_49                1 1 15 16 0=0.166667 1=0.5
Convolution              conv_13                  1 1 16 17 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
HardSwish                hswish_50                1 1 17 18 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_113               1 1 18 19 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
HardSwish                hswish_51                1 1 19 20 0=0.166667 1=0.5
Convolution              conv_14                  1 1 20 21 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSwish                hswish_52                1 1 21 22 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_114               1 1 22 23 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
HardSwish                hswish_53                1 1 23 24 0=0.166667 1=0.5
Convolution              conv_15                  1 1 24 25 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
HardSwish                hswish_54                1 1 25 26 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_115               1 1 26 27 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
HardSwish                hswish_55                1 1 27 28 0=0.166667 1=0.5
Convolution              conv_16                  1 1 28 29 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSwish                hswish_56                1 1 29 30 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_116               1 1 30 31 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
HardSwish                hswish_57                1 1 31 32 0=0.166667 1=0.5
Convolution              conv_17                  1 1 32 33 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSwish                hswish_58                1 1 33 34 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_117               1 1 34 35 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
HardSwish                hswish_59                1 1 35 36 0=0.166667 1=0.5
Convolution              conv_18                  1 1 36 37 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSwish                hswish_60                1 1 37 38 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_118               1 1 38 39 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
HardSwish                hswish_61                1 1 39 40 0=0.166667 1=0.5
Convolution              conv_19                  1 1 40 41 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSwish                hswish_62                1 1 41 42 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_119               1 1 42 43 0=256 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
HardSwish                hswish_63                1 1 43 44 0=0.166667 1=0.5
Convolution              conv_20                  1 1 44 45 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSwish                hswish_64                1 1 45 46 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_120               1 1 46 47 0=256 1=5 11=5 12=1 13=2 14=2 2=1 3=1 4=2 5=1 6=6400 7=256
HardSwish                hswish_65                1 1 47 48 0=0.166667 1=0.5
Split                    splitncnn_0              1 2 48 49 50
Pooling                  gap_37                   1 1 50 51 0=1 4=1
Convolution              convrelu_0               1 1 51 52 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384 9=1
Convolution              conv_22                  1 1 52 53 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
HardSigmoid              hsigmoid_40              1 1 53 54 0=0.166667 1=0.5
Reshape                  reshape_90               1 1 54 55 0=1 1=1 2=-1
BinaryOp                 mul_0                    2 1 49 55 56 0=2
Convolution              conv_23                  1 1 56 57 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
HardSwish                hswish_66                1 1 57 58 0=0.166667 1=0.5
ConvolutionDepthWise     convdw_121               1 1 58 59 0=512 1=5 11=5 12=1 13=1 14=2 2=1 3=2 4=2 5=1 6=12800 7=512
HardSwish                hswish_67                1 1 59 60 0=0.166667 1=0.5
Split                    splitncnn_1              1 2 60 61 62
Pooling                  gap_38                   1 1 62 63 0=1 4=1
Convolution              convrelu_1               1 1 63 64 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536 9=1
Convolution              conv_25                  1 1 64 65 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
HardSigmoid              hsigmoid_41              1 1 65 66 0=0.166667 1=0.5
Reshape                  reshape_91               1 1 66 67 0=1 1=1 2=-1
BinaryOp                 mul_1                    2 1 61 67 68 0=2
Convolution              conv_26                  1 1 68 69 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
HardSwish                hswish_68                1 1 69 70 0=0.166667 1=0.5
Pooling                  avgpool2d_39             1 1 70 71 0=1 1=2 11=2 12=2 13=0 2=2 3=0 5=1 6=0
Split                    splitncnn_2              1 2 71 72 73
Convolution              conv_27                  1 1 73 74 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=294912
Swish                    silu_71                  1 1 74 75
Convolution              conv_28                  1 1 75 76 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=7680
Swish                    silu_72                  1 1 76 77
Reshape                  reshape_92               1 1 77 78 0=40 1=120
Permute                  permute_81               1 1 78 79 0=1
Split                    splitncnn_3              1 2 79 80 81
LayerNorm                ln_32                    1 1 81 82 0=120 1=1.000000e-05 2=1
Gemm                     gemm_0                   1 1 82 83 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=360 9=120
Reshape                  reshape_93               1 1 83 84 0=15 1=8 11=3 2=40
Permute                  permute_82               1 1 84 85 0=8
Slice                    unbind_0                 1 3 85 86 87 88 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_94               1 1 88 89 0=15 1=40 11=8 2=1
Reshape                  reshape_95               1 1 87 90 0=15 1=40 11=8 2=1
Reshape                  reshape_96               1 1 86 91 0=15 1=40 11=8 2=1
MatMul                   matmultransb_0           2 1 91 90 92 0=1
BinaryOp                 mul_2                    1 1 92 93 0=2 1=1 2=0.258199
Softmax                  softmax_78               1 1 93 94 0=2 1=1
MatMul                   matmul_105               2 1 94 89 95
Reshape                  reshape_97               1 1 95 96 0=120 1=40
Gemm                     gemm_1                   1 1 96 97 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=120 9=120
BinaryOp                 add_3                    2 1 80 97 98 0=0
Split                    splitncnn_4              1 2 98 99 100
LayerNorm                ln_33                    1 1 100 101 0=120 1=1.000000e-05 2=1
Gemm                     gemm_2                   1 1 101 102 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=240 9=120
Swish                    silu_73                  1 1 102 103
Gemm                     gemm_3                   1 1 103 104 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=120 9=240
BinaryOp                 add_4                    2 1 99 104 105 0=0
Split                    splitncnn_5              1 2 105 106 107
LayerNorm                ln_34                    1 1 107 108 0=120 1=1.000000e-05 2=1
Gemm                     gemm_4                   1 1 108 109 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=360 9=120
Reshape                  reshape_98               1 1 109 110 0=15 1=8 11=3 2=40
Permute                  permute_85               1 1 110 111 0=8
Slice                    unbind_1                 1 3 111 112 113 114 -23300=3,-233,-233,-233 1=0
Reshape                  reshape_99               1 1 114 115 0=15 1=40 11=8 2=1
Reshape                  reshape_100              1 1 113 116 0=15 1=40 11=8 2=1
Reshape                  reshape_101              1 1 112 117 0=15 1=40 11=8 2=1
MatMul                   matmultransb_1           2 1 117 116 118 0=1
BinaryOp                 mul_5                    1 1 118 119 0=2 1=1 2=0.258199
Softmax                  softmax_79               1 1 119 120 0=2 1=1
MatMul                   matmul_107               2 1 120 115 121
Reshape                  reshape_102              1 1 121 122 0=120 1=40
Gemm                     gemm_5                   1 1 122 123 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=120 9=120
BinaryOp                 add_6                    2 1 106 123 124 0=0
Split                    splitncnn_6              1 2 124 125 126
LayerNorm                ln_35                    1 1 126 127 0=120 1=1.000000e-05 2=1
Gemm                     gemm_6                   1 1 127 128 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=240 9=120
Swish                    silu_74                  1 1 128 129
Gemm                     gemm_7                   1 1 129 130 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=120 9=240
BinaryOp                 add_7                    2 1 125 130 131 0=0
LayerNorm                ln_36                    1 1 131 132 0=120 1=1.000000e-06 2=1
Reshape                  reshape_103              1 1 132 133 0=120 1=40 2=1
Permute                  permute_88               1 1 133 134 0=4
Convolution              conv_29                  1 1 134 135 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=61440
Swish                    silu_75                  1 1 135 136
Concat                   cat_0                    2 1 72 136 137 0=0
Convolution              conv_30                  1 1 137 138 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_76                  1 1 138 139
Convolution              conv_31                  1 1 139 140 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_77                  1 1 140 141
Squeeze                  squeeze_108              1 1 141 142 -23303=1,1
Permute                  permute_89               1 1 142 143 0=1
Gemm                     gemm_8                   1 1 143 144 10=4 2=0 3=1 4=0 5=1 6=1 7=40 8=155 9=64
Softmax                  softmax_80               1 1 144 out0 0=1 1=1
